artillery.yaml
config:
  target: 'https://static-site.web.assurehedge.com'
  phases:
    - duration: 50
      arrivalRate: 1000
  defaults:
    headers:
scenarios:
  - flow:
      - get:
          # add the url you need to send get request
          url: "/"
          capture:
          # capturing responce using reg expression
            - regexp: "[^]*"
              as: "response"
      - log: "response= {{response}}"